areiter128/USB-PD-BoB/h/mcal/config/MA330045_P33CH_R10_pinmap.h
// Device Pin #13 is RC0
	#define ECP05_TRIS    TRISCbits.TRISC0 // GPIO direction register bit
	#define ECP05_WR      LATCbits.LATC0 // GPIO port latch register bit
	#define ECP05_RD      PORTCbits.RC0 // GPIO port register bit
	#define ECP05_ODC     ODCCbits.ODCC0 // GPIO port open drain configuration register bit
	#define ECP05_CNPU    CNPUCbits.CNPUC0 // GPIO port pull-up resistor register bit
	#define ECP05_CNPD    CNPDCbits.CNPDC0 // GPIO port pull-down resistor register bit
	#define ECP05_CNEN0   CNEN0Cbits.CNEN0C0 // GPIO port change notification Enable register bit
	#define ECP05_CNSTAT  CNSTATCbits.CNSTATC0 // GPIO port change notification Status register bit
	#define ECP05_CNEN1   CNEN1Cbits.CNEN1C0 // GPIO port change notification Edge Select Enable register bit
	#define ECP05_CNF     CNFCbits.CNFC0 // GPIO port change notification flag bit register bit
	#define ECP05_RP      48 // Number of Remappable Pin
	#define ECP05_SET     { asm volatile ("bset _LATC, #0 \n"); }
	#define ECP05_CLEAR   { asm volatile ("bclr _LATC, #0 \n"); }
	#define ECP05_TOGGLE  { asm volatile ("btg  _LATC, #0 \n"); }
	#define ECP05_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP05_ANSEL   _ANSELC0 // analog/digital pin configuration register bit
	#define ECP05_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP05_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP05_ADC_AN_INPUT 12   // ANx input pin number
	#define ECP05_ADCBUF  ADCBUF12 // ADC buffer register for this input
	#define ECP05_ADC_ANIE ADIELbits.IE12
	#define ECP05_ADC_ANEIE ADEIELbits.EIEN12
	#define ECP05_ADC_IF   _ADCAN12IF // interrupt flag bit
	#define ECP05_ADC_IE   _ADCAN12IE // interrupt enable bit
	#define ECP05_ADC_IP   _ADCAN12IP // interrupt priority for this analog input
	#define ECP05_ADC_RDY  _AN12RDY // ADC buffer ready bit
	#define _ECP05_ADC_Interrupt _ADCAN12Interrupt
	#define ECP05_INIT_ANALOG	{ECP05_ANSEL = 1; ECP05_WR = PINSTATE_HIGH; ECP05_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP05_INIT_OUTPUT  {ECP05_WR = PINSTATE_LOW; ECP05_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP05_INIT_INPUT   {ECP05_WR = PINSTATE_HIGH; ECP05_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #23 is RC2
	#define ECP06_TRIS    TRISCbits.TRISC2 // GPIO direction register bit
	#define ECP06_WR      LATCbits.LATC2 // GPIO port latch register bit
	#define ECP06_RD      PORTCbits.RC2 // GPIO port register bit
	#define ECP06_ODC     ODCCbits.ODCC2 // GPIO port open drain configuration register bit
	#define ECP06_CNPU    CNPUCbits.CNPUC2 // GPIO port pull-up resistor register bit
	#define ECP06_CNPD    CNPDCbits.CNPDC2 // GPIO port pull-down resistor register bit
	#define ECP06_CNEN0   CNEN0Cbits.CNEN0C2 // GPIO port change notification Enable register bit
	#define ECP06_CNSTAT  CNSTATCbits.CNSTATC2 // GPIO port change notification Status register bit
	#define ECP06_CNEN1   CNEN1Cbits.CNEN1C2 // GPIO port change notification Edge Select Enable register bit
	#define ECP06_CNF     CNFCbits.CNFC2 // GPIO port change notification flag bit register bit
	#define ECP06_RP      50 // Number of Remappable Pin
	#define ECP06_SET     { asm volatile ("bset _LATC, #2 \n"); }
	#define ECP06_CLEAR   { asm volatile ("bclr _LATC, #2 \n"); }
	#define ECP06_TOGGLE  { asm volatile ("btg  _LATC, #2 \n"); }
	#define ECP06_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP06_ANSEL   _ANSELC2 // analog/digital pin configuration register bit
	#define ECP06_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP06_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP06_ADC_AN_INPUT 14   // ANx input pin number
	#define ECP06_ADCBUF  ADCBUF14 // ADC buffer register for this input
	#define ECP06_ADC_ANIE ADIELbits.IE14
	#define ECP06_ADC_ANEIE ADEIELbits.EIEN14
	#define ECP06_ADC_IF   _ADCAN14IF // interrupt flag bit
	#define ECP06_ADC_IE   _ADCAN14IE // interrupt enable bit
	#define ECP06_ADC_IP   _ADCAN14IP // interrupt priority for this analog input
	#define ECP06_ADC_RDY  _AN14RDY // ADC buffer ready bit
	#define _ECP06_ADC_Interrupt _ADCAN14Interrupt
	#define ECP06_INIT_ANALOG	{ECP06_ANSEL = 1; ECP06_WR = PINSTATE_HIGH; ECP06_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP06_INIT_OUTPUT  {ECP06_WR = PINSTATE_LOW; ECP06_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP06_INIT_INPUT   {ECP06_WR = PINSTATE_HIGH; ECP06_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #27 is RC3
	#define ECP08_TRIS    TRISCbits.TRISC3 // GPIO direction register bit
	#define ECP08_WR      LATCbits.LATC3 // GPIO port latch register bit
	#define ECP08_RD      PORTCbits.RC3 // GPIO port register bit
	#define ECP08_ODC     ODCCbits.ODCC3 // GPIO port open drain configuration register bit
	#define ECP08_CNPU    CNPUCbits.CNPUC3 // GPIO port pull-up resistor register bit
	#define ECP08_CNPD    CNPDCbits.CNPDC3 // GPIO port pull-down resistor register bit
	#define ECP08_CNEN0   CNEN0Cbits.CNEN0C3 // GPIO port change notification Enable register bit
	#define ECP08_CNSTAT  CNSTATCbits.CNSTATC3 // GPIO port change notification Status register bit
	#define ECP08_CNEN1   CNEN1Cbits.CNEN1C3 // GPIO port change notification Edge Select Enable register bit
	#define ECP08_CNF     CNFCbits.CNFC3 // GPIO port change notification flag bit register bit
	#define ECP08_RP      51 // Number of Remappable Pin
	#define ECP08_SET     { asm volatile ("bset _LATC, #3 \n"); }
	#define ECP08_CLEAR   { asm volatile ("bclr _LATC, #3 \n"); }
	#define ECP08_TOGGLE  { asm volatile ("btg  _LATC, #3 \n"); }
	#define ECP08_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP08_INIT_OUTPUT  {ECP08_WR = PINSTATE_LOW; ECP08_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP08_INIT_INPUT   {ECP08_WR = PINSTATE_HIGH; ECP08_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #30 is RD11
	#define ECP09_TRIS    TRISDbits.TRISD11 // GPIO direction register bit
	#define ECP09_WR      LATDbits.LATD11 // GPIO port latch register bit
	#define ECP09_RD      PORTDbits.RD11 // GPIO port register bit
	#define ECP09_ODC     ODCDbits.ODCD11 // GPIO port open drain configuration register bit
	#define ECP09_CNPU    CNPUDbits.CNPUD11 // GPIO port pull-up resistor register bit
	#define ECP09_CNPD    CNPDDbits.CNPDD11 // GPIO port pull-down resistor register bit
	#define ECP09_CNEN0   CNEN0Dbits.CNEN0D11 // GPIO port change notification Enable register bit
	#define ECP09_CNSTAT  CNSTATDbits.CNSTATD11 // GPIO port change notification Status register bit
	#define ECP09_CNEN1   CNEN1Dbits.CNEN1D11 // GPIO port change notification Edge Select Enable register bit
	#define ECP09_CNF     CNFDbits.CNFD11 // GPIO port change notification flag bit register bit
	#define ECP09_SET     { asm volatile ("bset _LATD, #11 \n"); }
	#define ECP09_CLEAR   { asm volatile ("bclr _LATD, #11 \n"); }
	#define ECP09_TOGGLE  { asm volatile ("btg  _LATD, #11 \n"); }
	#define ECP09_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP09_INIT_OUTPUT  {ECP09_WR = PINSTATE_LOW; ECP09_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP09_INIT_INPUT   {ECP09_WR = PINSTATE_HIGH; ECP09_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #22 is RC1
	#define ECP10_TRIS    TRISCbits.TRISC1 // GPIO direction register bit
	#define ECP10_WR      LATCbits.LATC1 // GPIO port latch register bit
	#define ECP10_RD      PORTCbits.RC1 // GPIO port register bit
	#define ECP10_ODC     ODCCbits.ODCC1 // GPIO port open drain configuration register bit
	#define ECP10_CNPU    CNPUCbits.CNPUC1 // GPIO port pull-up resistor register bit
	#define ECP10_CNPD    CNPDCbits.CNPDC1 // GPIO port pull-down resistor register bit
	#define ECP10_CNEN0   CNEN0Cbits.CNEN0C1 // GPIO port change notification Enable register bit
	#define ECP10_CNSTAT  CNSTATCbits.CNSTATC1 // GPIO port change notification Status register bit
	#define ECP10_CNEN1   CNEN1Cbits.CNEN1C1 // GPIO port change notification Edge Select Enable register bit
	#define ECP10_CNF     CNFCbits.CNFC1 // GPIO port change notification flag bit register bit
	#define ECP10_RP      49 // Number of Remappable Pin
	#define ECP10_SET     { asm volatile ("bset _LATC, #1 \n"); }
	#define ECP10_CLEAR   { asm volatile ("bclr _LATC, #1 \n"); }
	#define ECP10_TOGGLE  { asm volatile ("btg  _LATC, #1 \n"); }
	#define ECP10_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP10_ANSEL   _ANSELC1 // analog/digital pin configuration register bit
	#define ECP10_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP10_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP10_ADC_AN_INPUT 13   // ANx input pin number
	#define ECP10_ADCBUF  ADCBUF13 // ADC buffer register for this input
	#define ECP10_ADC_ANIE ADIELbits.IE13
	#define ECP10_ADC_ANEIE ADEIELbits.EIEN13
	#define ECP10_ADC_IF   _ADCAN13IF // interrupt flag bit
	#define ECP10_ADC_IE   _ADCAN13IE // interrupt enable bit
	#define ECP10_ADC_IP   _ADCAN13IP // interrupt priority for this analog input
	#define ECP10_ADC_RDY  _AN13RDY // ADC buffer ready bit
	#define _ECP10_ADC_Interrupt _ADCAN13Interrupt
	#define ECP10_INIT_ANALOG	{ECP10_ANSEL = 1; ECP10_WR = PINSTATE_HIGH; ECP10_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP10_INIT_OUTPUT  {ECP10_WR = PINSTATE_LOW; ECP10_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP10_INIT_INPUT   {ECP10_WR = PINSTATE_HIGH; ECP10_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #16 is RA2
	#define ECP11_TRIS    TRISAbits.TRISA2 // GPIO direction register bit
	#define ECP11_WR      LATAbits.LATA2 // GPIO port latch register bit
	#define ECP11_RD      PORTAbits.RA2 // GPIO port register bit
	#define ECP11_ODC     ODCAbits.ODCA2 // GPIO port open drain configuration register bit
	#define ECP11_CNPU    CNPUAbits.CNPUA2 // GPIO port pull-up resistor register bit
	#define ECP11_CNPD    CNPDAbits.CNPDA2 // GPIO port pull-down resistor register bit
	#define ECP11_CNEN0   CNEN0Abits.CNEN0A2 // GPIO port change notification Enable register bit
	#define ECP11_CNSTAT  CNSTATAbits.CNSTATA2 // GPIO port change notification Status register bit
	#define ECP11_CNEN1   CNEN1Abits.CNEN1A2 // GPIO port change notification Edge Select Enable register bit
	#define ECP11_CNF     CNFAbits.CNFA2 // GPIO port change notification flag bit register bit
	#define ECP11_SET     { asm volatile ("bset _LATA, #2 \n"); }
	#define ECP11_CLEAR   { asm volatile ("bclr _LATA, #2 \n"); }
	#define ECP11_TOGGLE  { asm volatile ("btg  _LATA, #2 \n"); }
	#define ECP11_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP11_ANSEL   _ANSELA2 // analog/digital pin configuration register bit
	#define ECP11_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP11_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP11_ADC_AN_INPUT 2   // ANx input pin number
	#define ECP11_ADCBUF  ADCBUF2 // ADC buffer register for this input
	#define ECP11_ADC_ANIE ADIELbits.IE2
	#define ECP11_ADC_ANEIE ADEIELbits.EIEN2
	#define ECP11_ADC_IF   _ADCAN2IF // interrupt flag bit
	#define ECP11_ADC_IE   _ADCAN2IE // interrupt enable bit
	#define ECP11_ADC_IP   _ADCAN2IP // interrupt priority for this analog input
	#define ECP11_ADC_RDY  _AN2RDY // ADC buffer ready bit
	#define _ECP11_ADC_Interrupt _ADCAN2Interrupt
	#define ECP11_INIT_ANALOG	{ECP11_ANSEL = 1; ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP11_INIT_OUTPUT  {ECP11_WR = PINSTATE_LOW; ECP11_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP11_INIT_INPUT   {ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #17 is RA3
	#define ECP12_TRIS    TRISAbits.TRISA3 // GPIO direction register bit
	#define ECP12_WR      LATAbits.LATA3 // GPIO port latch register bit
	#define ECP12_RD      PORTAbits.RA3 // GPIO port register bit
	#define ECP12_ODC     ODCAbits.ODCA3 // GPIO port open drain configuration register bit
	#define ECP12_CNPU    CNPUAbits.CNPUA3 // GPIO port pull-up resistor register bit
	#define ECP12_CNPD    CNPDAbits.CNPDA3 // GPIO port pull-down resistor register bit
	#define ECP12_CNEN0   CNEN0Abits.CNEN0A3 // GPIO port change notification Enable register bit
	#define ECP12_CNSTAT  CNSTATAbits.CNSTATA3 // GPIO port change notification Status register bit
	#define ECP12_CNEN1   CNEN1Abits.CNEN1A3 // GPIO port change notification Edge Select Enable register bit
	#define ECP12_CNF     CNFAbits.CNFA3 // GPIO port change notification flag bit register bit
	#define ECP12_SET     { asm volatile ("bset _LATA, #3 \n"); }
	#define ECP12_CLEAR   { asm volatile ("bclr _LATA, #3 \n"); }
	#define ECP12_TOGGLE  { asm volatile ("btg  _LATA, #3 \n"); }
	#define ECP12_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP12_ANSEL   _ANSELA3 // analog/digital pin configuration register bit
	#define ECP12_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP12_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP12_ADC_AN_INPUT 3   // ANx input pin number
	#define ECP12_ADCBUF  ADCBUF3 // ADC buffer register for this input
	#define ECP12_ADC_ANIE ADIELbits.IE3
	#define ECP12_ADC_ANEIE ADEIELbits.EIEN3
	#define ECP12_ADC_IF   _ADCAN3IF // interrupt flag bit
	#define ECP12_ADC_IE   _ADCAN3IE // interrupt enable bit
	#define ECP12_ADC_IP   _ADCAN3IP // interrupt priority for this analog input
	#define ECP12_ADC_RDY  _AN3RDY // ADC buffer ready bit
	#define _ECP12_ADC_Interrupt _ADCAN3Interrupt
	#define ECP12_INIT_ANALOG	{ECP12_ANSEL = 1; ECP12_WR = PINSTATE_HIGH; ECP12_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP12_INIT_OUTPUT  {ECP12_WR = PINSTATE_LOW; ECP12_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP12_INIT_INPUT   {ECP12_WR = PINSTATE_HIGH; ECP12_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #15 is RA1
	#define ECP13_TRIS    TRISAbits.TRISA1 // GPIO direction register bit
	#define ECP13_WR      LATAbits.LATA1 // GPIO port latch register bit
	#define ECP13_RD      PORTAbits.RA1 // GPIO port register bit
	#define ECP13_ODC     ODCAbits.ODCA1 // GPIO port open drain configuration register bit
	#define ECP13_CNPU    CNPUAbits.CNPUA1 // GPIO port pull-up resistor register bit
	#define ECP13_CNPD    CNPDAbits.CNPDA1 // GPIO port pull-down resistor register bit
	#define ECP13_CNEN0   CNEN0Abits.CNEN0A1 // GPIO port change notification Enable register bit
	#define ECP13_CNSTAT  CNSTATAbits.CNSTATA1 // GPIO port change notification Status register bit
	#define ECP13_CNEN1   CNEN1Abits.CNEN1A1 // GPIO port change notification Edge Select Enable register bit
	#define ECP13_CNF     CNFAbits.CNFA1 // GPIO port change notification flag bit register bit
	#define ECP13_SET     { asm volatile ("bset _LATA, #1 \n"); }
	#define ECP13_CLEAR   { asm volatile ("bclr _LATA, #1 \n"); }
	#define ECP13_TOGGLE  { asm volatile ("btg  _LATA, #1 \n"); }
	#define ECP13_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP13_ANSEL   _ANSELA1 // analog/digital pin configuration register bit
	#define ECP13_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP13_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP13_ADC_AN_INPUT 1   // ANx input pin number
	#define ECP13_ADCBUF  ADCBUF1 // ADC buffer register for this input
	#define ECP13_ADC_ANIE ADIELbits.IE1
	#define ECP13_ADC_ANEIE ADEIELbits.EIEN1
	#define ECP13_ADC_IF   _ADCAN1IF // interrupt flag bit
	#define ECP13_ADC_IE   _ADCAN1IE // interrupt enable bit
	#define ECP13_ADC_IP   _ADCAN1IP // interrupt priority for this analog input
	#define ECP13_ADC_RDY  _AN1RDY // ADC buffer ready bit
	#define _ECP13_ADC_Interrupt _ADCAN1Interrupt
	#define ECP13_INIT_ANALOG	{ECP13_ANSEL = 1; ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP13_INIT_OUTPUT  {ECP13_WR = PINSTATE_LOW; ECP13_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP13_INIT_INPUT   {ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #18 is RA4
	#define ECP14_TRIS    TRISAbits.TRISA4 // GPIO direction register bit
	#define ECP14_WR      LATAbits.LATA4 // GPIO port latch register bit
	#define ECP14_RD      PORTAbits.RA4 // GPIO port register bit
	#define ECP14_ODC     ODCAbits.ODCA4 // GPIO port open drain configuration register bit
	#define ECP14_CNPU    CNPUAbits.CNPUA4 // GPIO port pull-up resistor register bit
	#define ECP14_CNPD    CNPDAbits.CNPDA4 // GPIO port pull-down resistor register bit
	#define ECP14_CNEN0   CNEN0Abits.CNEN0A4 // GPIO port change notification Enable register bit
	#define ECP14_CNSTAT  CNSTATAbits.CNSTATA4 // GPIO port change notification Status register bit
	#define ECP14_CNEN1   CNEN1Abits.CNEN1A4 // GPIO port change notification Edge Select Enable register bit
	#define ECP14_CNF     CNFAbits.CNFA4 // GPIO port change notification flag bit register bit
	#define ECP14_SET     { asm volatile ("bset _LATA, #4 \n"); }
	#define ECP14_CLEAR   { asm volatile ("bclr _LATA, #4 \n"); }
	#define ECP14_TOGGLE  { asm volatile ("btg  _LATA, #4 \n"); }
	#define ECP14_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP14_ANSEL   _ANSELA4 // analog/digital pin configuration register bit
	#define ECP14_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP14_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP14_ADC_AN_INPUT 4   // ANx input pin number
	#define ECP14_ADCBUF  ADCBUF4 // ADC buffer register for this input
	#define ECP14_ADC_ANIE ADIELbits.IE4
	#define ECP14_ADC_ANEIE ADEIELbits.EIEN4
	#define ECP14_ADC_IF   _ADCAN4IF // interrupt flag bit
	#define ECP14_ADC_IE   _ADCAN4IE // interrupt enable bit
	#define ECP14_ADC_IP   _ADCAN4IP // interrupt priority for this analog input
	#define ECP14_ADC_RDY  _AN4RDY // ADC buffer ready bit
	#define _ECP14_ADC_Interrupt _ADCAN4Interrupt
	#define ECP14_INIT_ANALOG	{ECP14_ANSEL = 1; ECP14_WR = PINSTATE_HIGH; ECP14_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP14_INIT_OUTPUT  {ECP14_WR = PINSTATE_LOW; ECP14_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP14_INIT_INPUT   {ECP14_WR = PINSTATE_HIGH; ECP14_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #14 is RA0
	#define ECP15_TRIS    TRISAbits.TRISA0 // GPIO direction register bit
	#define ECP15_WR      LATAbits.LATA0 // GPIO port latch register bit
	#define ECP15_RD      PORTAbits.RA0 // GPIO port register bit
	#define ECP15_ODC     ODCAbits.ODCA0 // GPIO port open drain configuration register bit
	#define ECP15_CNPU    CNPUAbits.CNPUA0 // GPIO port pull-up resistor register bit
	#define ECP15_CNPD    CNPDAbits.CNPDA0 // GPIO port pull-down resistor register bit
	#define ECP15_CNEN0   CNEN0Abits.CNEN0A0 // GPIO port change notification Enable register bit
	#define ECP15_CNSTAT  CNSTATAbits.CNSTATA0 // GPIO port change notification Status register bit
	#define ECP15_CNEN1   CNEN1Abits.CNEN1A0 // GPIO port change notification Edge Select Enable register bit
	#define ECP15_CNF     CNFAbits.CNFA0 // GPIO port change notification flag bit register bit
	#define ECP15_SET     { asm volatile ("bset _LATA, #0 \n"); }
	#define ECP15_CLEAR   { asm volatile ("bclr _LATA, #0 \n"); }
	#define ECP15_TOGGLE  { asm volatile ("btg  _LATA, #0 \n"); }
	#define ECP15_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP15_ANSEL   _ANSELA0 // analog/digital pin configuration register bit
	#define ECP15_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP15_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP15_ADC_AN_INPUT 0   // ANx input pin number
	#define ECP15_ADCBUF  ADCBUF0 // ADC buffer register for this input
	#define ECP15_ADC_ANIE ADIELbits.IE0
	#define ECP15_ADC_ANEIE ADEIELbits.EIEN0
	#define ECP15_ADC_IF   _ADCAN0IF // interrupt flag bit
	#define ECP15_ADC_IE   _ADCAN0IE // interrupt enable bit
	#define ECP15_ADC_IP   _ADCAN0IP // interrupt priority for this analog input
	#define ECP15_ADC_RDY  _AN0RDY // ADC buffer ready bit
	#define _ECP15_ADC_Interrupt _ADCAN0Interrupt
	#define ECP15_INIT_ANALOG	{ECP15_ANSEL = 1; ECP15_WR = PINSTATE_HIGH; ECP15_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP15_INIT_OUTPUT  {ECP15_WR = PINSTATE_LOW; ECP15_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP15_INIT_INPUT   {ECP15_WR = PINSTATE_HIGH; ECP15_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
