areiter128/USB-PD-BoB/h/mcal/config/MA330045_P33CH_R10_pinmap.h
// Device Pin #36 is RC8
	#define ECP24_TRIS    TRISCbits.TRISC8 // GPIO direction register bit
	#define ECP24_WR      LATCbits.LATC8 // GPIO port latch register bit
	#define ECP24_RD      PORTCbits.RC8 // GPIO port register bit
	#define ECP24_ODC     ODCCbits.ODCC8 // GPIO port open drain configuration register bit
	#define ECP24_CNPU    CNPUCbits.CNPUC8 // GPIO port pull-up resistor register bit
	#define ECP24_CNPD    CNPDCbits.CNPDC8 // GPIO port pull-down resistor register bit
	#define ECP24_CNEN0   CNEN0Cbits.CNEN0C8 // GPIO port change notification Enable register bit
	#define ECP24_CNSTAT  CNSTATCbits.CNSTATC8 // GPIO port change notification Status register bit
	#define ECP24_CNEN1   CNEN1Cbits.CNEN1C8 // GPIO port change notification Edge Select Enable register bit
	#define ECP24_CNF     CNFCbits.CNFC8 // GPIO port change notification flag bit register bit
	#define ECP24_RP      56 // Number of Remappable Pin
	#define ECP24_SET     { asm volatile ("bset _LATC, #8 \n"); }
	#define ECP24_CLEAR   { asm volatile ("bclr _LATC, #8 \n"); }
	#define ECP24_TOGGLE  { asm volatile ("btg  _LATC, #8 \n"); }
	#define ECP24_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP24_INIT_OUTPUT  {ECP24_WR = PINSTATE_LOW; ECP24_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP24_INIT_INPUT   {ECP24_WR = PINSTATE_HIGH; ECP24_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #63 is RB12
	#define ECP25_TRIS    TRISBbits.TRISB12 // GPIO direction register bit
	#define ECP25_WR      LATBbits.LATB12 // GPIO port latch register bit
	#define ECP25_RD      PORTBbits.RB12 // GPIO port register bit
	#define ECP25_ODC     ODCBbits.ODCB12 // GPIO port open drain configuration register bit
	#define ECP25_CNPU    CNPUBbits.CNPUB12 // GPIO port pull-up resistor register bit
	#define ECP25_CNPD    CNPDBbits.CNPDB12 // GPIO port pull-down resistor register bit
	#define ECP25_CNEN0   CNEN0Bbits.CNEN0B12 // GPIO port change notification Enable register bit
	#define ECP25_CNSTAT  CNSTATBbits.CNSTATB12 // GPIO port change notification Status register bit
	#define ECP25_CNEN1   CNEN1Bbits.CNEN1B12 // GPIO port change notification Edge Select Enable register bit
	#define ECP25_CNF     CNFBbits.CNFB12 // GPIO port change notification flag bit register bit
	#define ECP25_RP      44 // Number of Remappable Pin
	#define ECP25_SET     { asm volatile ("bset _LATB, #12 \n"); }
	#define ECP25_CLEAR   { asm volatile ("bclr _LATB, #12 \n"); }
	#define ECP25_TOGGLE  { asm volatile ("btg  _LATB, #12 \n"); }
	#define ECP25_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP25_INIT_OUTPUT  {ECP25_WR = PINSTATE_LOW; ECP25_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP25_INIT_INPUT   {ECP25_WR = PINSTATE_HIGH; ECP25_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP25_PGx_CHANNEL  2 // PWM channel index
	#define ECP25_PGx_PER      PG2PER // PWM channel period register
	#define ECP25_PGx_PHASE    PG2PHASE // PWM channel phase register
	#define ECP25_PGx_DC       PG2DC // PWM channel duty cycle register
	#define ECP25_PGx_OVRENH   PG2IOCONLbits.OVRENH // PWM channel IO config register override high control bit
	#define ECP25_PGx_PENH     PG2IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
	#define ECP25_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP25_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
	#define ECP25_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
	#define ECP25_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register
	
// Device Pin #11 is RD14
	#define ECP26_TRIS    TRISDbits.TRISD14 // GPIO direction register bit
	#define ECP26_WR      LATDbits.LATD14 // GPIO port latch register bit
	#define ECP26_RD      PORTDbits.RD14 // GPIO port register bit
	#define ECP26_ODC     ODCDbits.ODCD14 // GPIO port open drain configuration register bit
	#define ECP26_CNPU    CNPUDbits.CNPUD14 // GPIO port pull-up resistor register bit
	#define ECP26_CNPD    CNPDDbits.CNPDD14 // GPIO port pull-down resistor register bit
	#define ECP26_CNEN0   CNEN0Dbits.CNEN0D14 // GPIO port change notification Enable register bit
	#define ECP26_CNSTAT  CNSTATDbits.CNSTATD14 // GPIO port change notification Status register bit
	#define ECP26_CNEN1   CNEN1Dbits.CNEN1D14 // GPIO port change notification Edge Select Enable register bit
	#define ECP26_CNF     CNFDbits.CNFD14 // GPIO port change notification flag bit register bit
	#define ECP26_SET     { asm volatile ("bset _LATD, #14 \n"); }
	#define ECP26_CLEAR   { asm volatile ("bclr _LATD, #14 \n"); }
	#define ECP26_TOGGLE  { asm volatile ("btg  _LATD, #14 \n"); }
	#define ECP26_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP26_INIT_OUTPUT  {ECP26_WR = PINSTATE_LOW; ECP26_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP26_INIT_INPUT   {ECP26_WR = PINSTATE_HIGH; ECP26_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #64 is RB13
	#define ECP27_TRIS    TRISBbits.TRISB13 // GPIO direction register bit
	#define ECP27_WR      LATBbits.LATB13 // GPIO port latch register bit
	#define ECP27_RD      PORTBbits.RB13 // GPIO port register bit
	#define ECP27_ODC     ODCBbits.ODCB13 // GPIO port open drain configuration register bit
	#define ECP27_CNPU    CNPUBbits.CNPUB13 // GPIO port pull-up resistor register bit
	#define ECP27_CNPD    CNPDBbits.CNPDB13 // GPIO port pull-down resistor register bit
	#define ECP27_CNEN0   CNEN0Bbits.CNEN0B13 // GPIO port change notification Enable register bit
	#define ECP27_CNSTAT  CNSTATBbits.CNSTATB13 // GPIO port change notification Status register bit
	#define ECP27_CNEN1   CNEN1Bbits.CNEN1B13 // GPIO port change notification Edge Select Enable register bit
	#define ECP27_CNF     CNFBbits.CNFB13 // GPIO port change notification flag bit register bit
	#define ECP27_RP      45 // Number of Remappable Pin
	#define ECP27_SET     { asm volatile ("bset _LATB, #13 \n"); }
	#define ECP27_CLEAR   { asm volatile ("bclr _LATB, #13 \n"); }
	#define ECP27_TOGGLE  { asm volatile ("btg  _LATB, #13 \n"); }
	#define ECP27_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP27_INIT_OUTPUT  {ECP27_WR = PINSTATE_LOW; ECP27_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP27_INIT_INPUT   {ECP27_WR = PINSTATE_HIGH; ECP27_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP27_PGx_CHANNEL  2 // PWM channel index
	#define ECP27_PGx_PER      PG2PER // PWM channel period register
	#define ECP27_PGx_PHASE    PG2PHASE // PWM channel phase register
	#define ECP27_PGx_DC       PG2DC // PWM channel duty cycle register
	#define ECP27_PGx_OVRENL   PG2IOCONLbits.OVRENL // PWM channel IO config register override low control bit
	#define ECP27_PGx_PENL     PG2IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
	#define ECP27_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP27_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
	#define ECP27_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
	#define ECP27_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register
	
// Device Pin #38 is RD9
	#define ECP28_TRIS    TRISDbits.TRISD9 // GPIO direction register bit
	#define ECP28_WR      LATDbits.LATD9 // GPIO port latch register bit
	#define ECP28_RD      PORTDbits.RD9 // GPIO port register bit
	#define ECP28_ODC     ODCDbits.ODCD9 // GPIO port open drain configuration register bit
	#define ECP28_CNPU    CNPUDbits.CNPUD9 // GPIO port pull-up resistor register bit
	#define ECP28_CNPD    CNPDDbits.CNPDD9 // GPIO port pull-down resistor register bit
	#define ECP28_CNEN0   CNEN0Dbits.CNEN0D9 // GPIO port change notification Enable register bit
	#define ECP28_CNSTAT  CNSTATDbits.CNSTATD9 // GPIO port change notification Status register bit
	#define ECP28_CNEN1   CNEN1Dbits.CNEN1D9 // GPIO port change notification Edge Select Enable register bit
	#define ECP28_CNF     CNFDbits.CNFD9 // GPIO port change notification flag bit register bit
	#define ECP28_SET     { asm volatile ("bset _LATD, #9 \n"); }
	#define ECP28_CLEAR   { asm volatile ("bclr _LATD, #9 \n"); }
	#define ECP28_TOGGLE  { asm volatile ("btg  _LATD, #9 \n"); }
	#define ECP28_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP28_INIT_OUTPUT  {ECP28_WR = PINSTATE_LOW; ECP28_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP28_INIT_INPUT   {ECP28_WR = PINSTATE_HIGH; ECP28_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #43 is RD6
	#define ECP31_TRIS    TRISDbits.TRISD6 // GPIO direction register bit
	#define ECP31_WR      LATDbits.LATD6 // GPIO port latch register bit
	#define ECP31_RD      PORTDbits.RD6 // GPIO port register bit
	#define ECP31_ODC     ODCDbits.ODCD6 // GPIO port open drain configuration register bit
	#define ECP31_CNPU    CNPUDbits.CNPUD6 // GPIO port pull-up resistor register bit
	#define ECP31_CNPD    CNPDDbits.CNPDD6 // GPIO port pull-down resistor register bit
	#define ECP31_CNEN0   CNEN0Dbits.CNEN0D6 // GPIO port change notification Enable register bit
	#define ECP31_CNSTAT  CNSTATDbits.CNSTATD6 // GPIO port change notification Status register bit
	#define ECP31_CNEN1   CNEN1Dbits.CNEN1D6 // GPIO port change notification Edge Select Enable register bit
	#define ECP31_CNF     CNFDbits.CNFD6 // GPIO port change notification flag bit register bit
	#define ECP31_RP      70 // Number of Remappable Pin
	#define ECP31_SET     { asm volatile ("bset _LATD, #6 \n"); }
	#define ECP31_CLEAR   { asm volatile ("bclr _LATD, #6 \n"); }
	#define ECP31_TOGGLE  { asm volatile ("btg  _LATD, #6 \n"); }
	#define ECP31_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP31_INIT_OUTPUT  {ECP31_WR = PINSTATE_LOW; ECP31_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP31_INIT_INPUT   {ECP31_WR = PINSTATE_HIGH; ECP31_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
