areiter128/USB-PD-BoB/h/mcal/config/MA330045_P33CH_R10_pinmap.h
// Device Pin #3 is RC12
	#define ECP46_TRIS    TRISCbits.TRISC12 // GPIO direction register bit
	#define ECP46_WR      LATCbits.LATC12 // GPIO port latch register bit
	#define ECP46_RD      PORTCbits.RC12 // GPIO port register bit
	#define ECP46_ODC     ODCCbits.ODCC12 // GPIO port open drain configuration register bit
	#define ECP46_CNPU    CNPUCbits.CNPUC12 // GPIO port pull-up resistor register bit
	#define ECP46_CNPD    CNPDCbits.CNPDC12 // GPIO port pull-down resistor register bit
	#define ECP46_CNEN0   CNEN0Cbits.CNEN0C12 // GPIO port change notification Enable register bit
	#define ECP46_CNSTAT  CNSTATCbits.CNSTATC12 // GPIO port change notification Status register bit
	#define ECP46_CNEN1   CNEN1Cbits.CNEN1C12 // GPIO port change notification Edge Select Enable register bit
	#define ECP46_CNF     CNFCbits.CNFC12 // GPIO port change notification flag bit register bit
	#define ECP46_RP      60 // Number of Remappable Pin
	#define ECP46_SET     { asm volatile ("bset _LATC, #12 \n"); }
	#define ECP46_CLEAR   { asm volatile ("bclr _LATC, #12 \n"); }
	#define ECP46_TOGGLE  { asm volatile ("btg  _LATC, #12 \n"); }
	#define ECP46_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP46_INIT_OUTPUT  {ECP46_WR = PINSTATE_LOW; ECP46_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP46_INIT_INPUT   {ECP46_WR = PINSTATE_HIGH; ECP46_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP46_PGx_CHANNEL  4 // PWM channel index
	#define ECP46_PGx_PER      PG4PER // PWM channel period register
	#define ECP46_PGx_PHASE    PG4PHASE // PWM channel phase register
	#define ECP46_PGx_DC       PG4DC // PWM channel duty cycle register
	#define ECP46_PGx_OVRENH   PG4IOCONLbits.OVRENH // PWM channel IO config register override high control bit
	#define ECP46_PGx_PENH     PG4IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
	#define ECP46_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP46_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
	#define ECP46_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
	#define ECP46_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register
	
// Device Pin #53 is RC11
	#define ECP47_TRIS    TRISCbits.TRISC11 // GPIO direction register bit
	#define ECP47_WR      LATCbits.LATC11 // GPIO port latch register bit
	#define ECP47_RD      PORTCbits.RC11 // GPIO port register bit
	#define ECP47_ODC     ODCCbits.ODCC11 // GPIO port open drain configuration register bit
	#define ECP47_CNPU    CNPUCbits.CNPUC11 // GPIO port pull-up resistor register bit
	#define ECP47_CNPD    CNPDCbits.CNPDC11 // GPIO port pull-down resistor register bit
	#define ECP47_CNEN0   CNEN0Cbits.CNEN0C11 // GPIO port change notification Enable register bit
	#define ECP47_CNSTAT  CNSTATCbits.CNSTATC11 // GPIO port change notification Status register bit
	#define ECP47_CNEN1   CNEN1Cbits.CNEN1C11 // GPIO port change notification Edge Select Enable register bit
	#define ECP47_CNF     CNFCbits.CNFC11 // GPIO port change notification flag bit register bit
	#define ECP47_RP      59 // Number of Remappable Pin
	#define ECP47_SET     { asm volatile ("bset _LATC, #11 \n"); }
	#define ECP47_CLEAR   { asm volatile ("bclr _LATC, #11 \n"); }
	#define ECP47_TOGGLE  { asm volatile ("btg  _LATC, #11 \n"); }
	#define ECP47_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP47_INIT_OUTPUT  {ECP47_WR = PINSTATE_LOW; ECP47_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP47_INIT_INPUT   {ECP47_WR = PINSTATE_HIGH; ECP47_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #4 is RC13
	#define ECP48_TRIS    TRISCbits.TRISC13 // GPIO direction register bit
	#define ECP48_WR      LATCbits.LATC13 // GPIO port latch register bit
	#define ECP48_RD      PORTCbits.RC13 // GPIO port register bit
	#define ECP48_ODC     ODCCbits.ODCC13 // GPIO port open drain configuration register bit
	#define ECP48_CNPU    CNPUCbits.CNPUC13 // GPIO port pull-up resistor register bit
	#define ECP48_CNPD    CNPDCbits.CNPDC13 // GPIO port pull-down resistor register bit
	#define ECP48_CNEN0   CNEN0Cbits.CNEN0C13 // GPIO port change notification Enable register bit
	#define ECP48_CNSTAT  CNSTATCbits.CNSTATC13 // GPIO port change notification Status register bit
	#define ECP48_CNEN1   CNEN1Cbits.CNEN1C13 // GPIO port change notification Edge Select Enable register bit
	#define ECP48_CNF     CNFCbits.CNFC13 // GPIO port change notification flag bit register bit
	#define ECP48_RP      61 // Number of Remappable Pin
	#define ECP48_SET     { asm volatile ("bset _LATC, #13 \n"); }
	#define ECP48_CLEAR   { asm volatile ("bclr _LATC, #13 \n"); }
	#define ECP48_TOGGLE  { asm volatile ("btg  _LATC, #13 \n"); }
	#define ECP48_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP48_INIT_OUTPUT  {ECP48_WR = PINSTATE_LOW; ECP48_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP48_INIT_INPUT   {ECP48_WR = PINSTATE_HIGH; ECP48_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP48_PGx_CHANNEL  4 // PWM channel index
	#define ECP48_PGx_PER      PG4PER // PWM channel period register
	#define ECP48_PGx_PHASE    PG4PHASE // PWM channel phase register
	#define ECP48_PGx_DC       PG4DC // PWM channel duty cycle register
	#define ECP48_PGx_OVRENL   PG4IOCONLbits.OVRENL // PWM channel IO config register override low control bit
	#define ECP48_PGx_PENL     PG4IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
	#define ECP48_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP48_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
	#define ECP48_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
	#define ECP48_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register
	
// Device Pin #42 is RD7
	#define ECP50_TRIS    TRISDbits.TRISD7 // GPIO direction register bit
	#define ECP50_WR      LATDbits.LATD7 // GPIO port latch register bit
	#define ECP50_RD      PORTDbits.RD7 // GPIO port register bit
	#define ECP50_ODC     ODCDbits.ODCD7 // GPIO port open drain configuration register bit
	#define ECP50_CNPU    CNPUDbits.CNPUD7 // GPIO port pull-up resistor register bit
	#define ECP50_CNPD    CNPDDbits.CNPDD7 // GPIO port pull-down resistor register bit
	#define ECP50_CNEN0   CNEN0Dbits.CNEN0D7 // GPIO port change notification Enable register bit
	#define ECP50_CNSTAT  CNSTATDbits.CNSTATD7 // GPIO port change notification Status register bit
	#define ECP50_CNEN1   CNEN1Dbits.CNEN1D7 // GPIO port change notification Edge Select Enable register bit
	#define ECP50_CNF     CNFDbits.CNFD7 // GPIO port change notification flag bit register bit
	#define ECP50_RP      71 // Number of Remappable Pin
	#define ECP50_SET     { asm volatile ("bset _LATD, #7 \n"); }
	#define ECP50_CLEAR   { asm volatile ("bclr _LATD, #7 \n"); }
	#define ECP50_TOGGLE  { asm volatile ("btg  _LATD, #7 \n"); }
	#define ECP50_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP50_INIT_OUTPUT  {ECP50_WR = PINSTATE_LOW; ECP50_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP50_INIT_INPUT   {ECP50_WR = PINSTATE_HIGH; ECP50_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #39 is RD8
	#define ECP52_TRIS    TRISDbits.TRISD8 // GPIO direction register bit
	#define ECP52_WR      LATDbits.LATD8 // GPIO port latch register bit
	#define ECP52_RD      PORTDbits.RD8 // GPIO port register bit
	#define ECP52_ODC     ODCDbits.ODCD8 // GPIO port open drain configuration register bit
	#define ECP52_CNPU    CNPUDbits.CNPUD8 // GPIO port pull-up resistor register bit
	#define ECP52_CNPD    CNPDDbits.CNPDD8 // GPIO port pull-down resistor register bit
	#define ECP52_CNEN0   CNEN0Dbits.CNEN0D8 // GPIO port change notification Enable register bit
	#define ECP52_CNSTAT  CNSTATDbits.CNSTATD8 // GPIO port change notification Status register bit
	#define ECP52_CNEN1   CNEN1Dbits.CNEN1D8 // GPIO port change notification Edge Select Enable register bit
	#define ECP52_CNF     CNFDbits.CNFD8 // GPIO port change notification flag bit register bit
	#define ECP52_SET     { asm volatile ("bset _LATD, #8 \n"); }
	#define ECP52_CLEAR   { asm volatile ("bclr _LATD, #8 \n"); }
	#define ECP52_TOGGLE  { asm volatile ("btg  _LATD, #8 \n"); }
	#define ECP52_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP52_INIT_OUTPUT  {ECP52_WR = PINSTATE_LOW; ECP52_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP52_INIT_INPUT   {ECP52_WR = PINSTATE_HIGH; ECP52_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #35 is RB4
	#define PGC_TRIS    TRISBbits.TRISB4 // GPIO direction register bit
	#define PGC_WR      LATBbits.LATB4 // GPIO port latch register bit
	#define PGC_RD      PORTBbits.RB4 // GPIO port register bit
	#define PGC_ODC     ODCBbits.ODCB4 // GPIO port open drain configuration register bit
	#define PGC_CNPU    CNPUBbits.CNPUB4 // GPIO port pull-up resistor register bit
	#define PGC_CNPD    CNPDBbits.CNPDB4 // GPIO port pull-down resistor register bit
	#define PGC_CNEN0   CNEN0Bbits.CNEN0B4 // GPIO port change notification Enable register bit
	#define PGC_CNSTAT  CNSTATBbits.CNSTATB4 // GPIO port change notification Status register bit
	#define PGC_CNEN1   CNEN1Bbits.CNEN1B4 // GPIO port change notification Edge Select Enable register bit
	#define PGC_CNF     CNFBbits.CNFB4 // GPIO port change notification flag bit register bit
	#define PGC_RP      36 // Number of Remappable Pin
	#define PGC_SET     { asm volatile ("bset _LATB, #4 \n"); }
	#define PGC_CLEAR   { asm volatile ("bclr _LATB, #4 \n"); }
	#define PGC_TOGGLE  { asm volatile ("btg  _LATB, #4 \n"); }
	#define PGC_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define PGC_INIT_OUTPUT  {PGC_WR = PINSTATE_LOW; PGC_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define PGC_INIT_INPUT   {PGC_WR = PINSTATE_HIGH; PGC_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
